title: Suspect bitsadmin jobs
mitre: Defense Evasion: Bits Jobs
author: slg997
query:  """
        DeviceProcessEvents
        | where FileName =~ "bitsadmin.exe"
        | extend extractip = extract(@"(\d{1,3}\.){3}\d{1,3}",0,ProcessCommandLine)
        | where not(extractip == "127.0.0.1")
        | where ProcessCommandLine has "/transfer" 
            and (ProcessCommandLine has "/download" or ipv4_is_private(extractip) == false or ProcessCommandLine matches regex "(?i)http(s|):")
        | sort by Timestamp asc
        """
